html/20231125T180911--vim__code.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/org-static-blog/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/org-static-blog/html">
<title>vim</title>
</head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">14 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/org-static-blog/html/20231125T180911--vim__code.html">vim</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf9e924e">1. Vim</a>
<ul>
<li><a href="#org3d1c0be">1.1. Vim bindings in evil</a></li>
<li><a href="#org8655544">1.2. <span class="timestamp-wrapper"><span class="timestamp">[2022-12-03 Sat] </span></span> I tried!!</a></li>
<li><a href="#orgd7261ea">1.3. Vim bindings in evil</a></li>
<li><a href="#org66ca713">1.4. Emacs/Evil for vim users didelis gidas apie evil</a></li>
<li><a href="#orgf2529ca">1.5. evil mode documentation</a></li>
<li><a href="#orgc0337b3">1.6. old .vimrcp</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgf9e924e" class="outline-2">
<h2 id="orgf9e924e"><span class="section-number-2">1.</span> Vim</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3d1c0be" class="outline-3">
<h3 id="org3d1c0be"><span class="section-number-3">1.1.</span> Vim bindings in evil</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Well, I'm not sure how relevant my experience is to your case.
Originally i used Emacs in favor of Vim. Evil just makes Emacs a
straight up better Vim and the emulation is as good as flawless.
</p>

<p>
Vscode happens to also have a pretty decent vim emulation.
</p>

<p>
It's not as configurable and in the beginning it feels incredibly
restrictive to not be able to customise everything and script things
on the fly.
</p>

<p>
But after a while you realise that it's as much a blessing as it is a
curse. Because of this it relies on sane defaults instead, and
suddenly you'll find yourself messing with your config once a month
rather than twice a day.
</p>

<p>
Just added something new to your stack or need language support for a
new language? Just search for it in the built-in extension manager,
press install and you're <b>done</b>. Back to work. No manual needed, no time
wasted scrolling through their issue tracker to figure out why the
hell you can't get LSP support or completions to work. It Just Works™.
</p>

<p>
That said I still miss a lot of things, and it regularly gets on my
nerves. But it definitely makes me more productive.
</p>
</div>
</div>
<div id="outline-container-org8655544" class="outline-3">
<h3 id="org8655544"><span class="section-number-3">1.2.</span> <span class="timestamp-wrapper"><span class="timestamp">[2022-12-03 Sat] </span></span> I tried!!</h3>
<div class="outline-text-3" id="text-1-2">
<p>
isirasiau evil emacse
org mode neveikia tab vscode.. tingejau ieskotis. + blet nebus ten
agenda, tai koks tolkas daryti kazka su datomis.. zodziu.. aciu, ne.
kaip projektu ieskoti vscode
</p>

<p>
galiausiai pagalvojau&#x2026; ble, jeigu man dabar gerai, kam man
isradineti dvirati ir meginti priprasti prie naujos sistemos be AISKIU
benfits. Dabar supratau, jog tai darau vien del to, kad kazkas pasake,
jog evil yra nice. Ne aciu.
</p>

<p>
Kai tikrai pamatysiu, jog man reikia, tuo met ir ismoksiu visus
dalykys. O, geras, isjungiau company mode ir org major mode - nebemeta
tu damn suggestions. Gal ir gerai.
</p>
</div>
</div>
<div id="outline-container-orgd7261ea" class="outline-3">
<h3 id="orgd7261ea"><span class="section-number-3">1.3.</span> Vim bindings in evil</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Well, I'm not sure how relevant my experience is to your case.
Originally i used Emacs in favor of Vim. Evil just makes Emacs a
straight up better Vim and the emulation is as good as flawless.
</p>

<p>
Vscode happens to also have a pretty decent vim emulation.
</p>

<p>
It's not as configurable and in the beginning it feels incredibly
restrictive to not be able to customise everything and script things
on the fly.
</p>

<p>
But after a while you realise that it's as much a blessing as it is a
curse. Because of this it relies on sane defaults instead, and
suddenly you'll find yourself messing with your config once a month
rather than twice a day.
</p>

<p>
Just added something new to your stack or need language support for a
new language? Just search for it in the built-in extension manager,
press install and you're <b>done</b>. Back to work. No manual needed, no time
wasted scrolling through their issue tracker to figure out why the
hell you can't get LSP support or completions to work. It Just Works™.
</p>

<p>
That said I still miss a lot of things, and it regularly gets on my
nerves. But it definitely makes me more productive.
</p>
</div>
</div>
<div id="outline-container-org66ca713" class="outline-3">
<h3 id="org66ca713"><span class="section-number-3">1.4.</span> <a href="https://github.com/noctuid/evil-guide">Emacs/Evil for vim users didelis gidas apie evil</a></h3>
</div>
<div id="outline-container-orgf2529ca" class="outline-3">
<h3 id="orgf2529ca"><span class="section-number-3">1.5.</span> <a href="https://evil.readthedocs.io/en/latest/overview.html">evil mode documentation</a></h3>
</div>
<div id="outline-container-orgc0337b3" class="outline-3">
<h3 id="orgc0337b3"><span class="section-number-3">1.6.</span> old .vimrcp</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-bash">" -----------------------------------------------------------------------------
" Plugins
" -----------------------------------------------------------------------------

call plug#begin('~/.vim/plugged')
Plug 'scrooloose/nerdcommenter' " comment text out
Plug 'tpope/vim-surround' " surround text with ' { ( or edit html tags
Plug 'itchyny/lightline.vim' " indicating modes and more info bottom bar
Plug 'junegunn/fzf', { 'do': { -&gt; fzf#install() } }
Plug 'junegunn/fzf.vim' " fuzzy file finder
Plug 'easymotion/vim-easymotion' "jump to word
Plug 'morhetz/gruvbox' " theme
Plug 'mattn/emmet-vim' "adding html tags
Plug 'vim-scripts/AutoComplPop' " super duper text autocompletion
Plug 'machakann/vim-highlightedyank' "highlight yanked text
call plug#end()

" -----------------------------------------------------------------------------
" Stuff
" -----------------------------------------------------------------------------

syntax on
set number relativenumber
set laststatus=2
set colorcolumn=80
set cursorline
set tabstop=2
set softtabstop=2
set shiftwidth=2
set expandtab
set smarttab
set nowrap
set textwidth=0
set mouse=n
set noerrorbells
set autoindent
set copyindent
set virtualedit=all
set ignorecase
set incsearch
set smartcase
set hidden "buffers
set complete+=kspell
set completeopt=menuone,longest " :h completeopt
set shortmess+=c " don't pass messages to |ins-completion-menu|
set t_Co=256
set background=dark
colorscheme gruvbox
" Ignore rules for file editing
set wildmenu  "shows multiple matches on one line
set wildchar=&lt;tab&gt;
set wildmode=list:full
set wildignore+=*.swp,*.bak,*.pyc,*.pyo,*.so,*~,*.zip,*.gz,*.tar
set wildignore+=virtual/,.virtualenv/,upload/,uploads/,node_modules/
" Autosave
set updatetime=1000
autocmd CursorHold,CursorHoldI * silent update

" -----------------------------------------------------------------------------
" Shortcuts
" -----------------------------------------------------------------------------

" nnoremap &lt;F2&gt; :e $MYVIMRC&lt;CR&gt;
" nnoremap &lt;F3&gt; :source $MYVIMRC&lt;CR&gt;

let mapleader=" "

nnoremap B ^
nnoremap E $

inoremap kj  &lt;ESC&gt;

:command WQ wq
:command Wq wq
:command W w
:command Q q

let g:user_emmet_mode='n'      "only enable normal mode functions
let g:user_emmet_leader_key=','

let g:NERDSpaceDelims=1
let g:NERDDefaultAlign = 'left'

let g:highlightedyank_highlight_duration = 500
let g:highlightedyank_highlight_duration = -1

" Press * to search for the term under the cursor or a visual selection and
" then press a key below to replace all instances of it in the current file.
nnoremap &lt;Leader&gt;r :%s///g&lt;Left&gt;&lt;Left&gt;
nnoremap &lt;Leader&gt;rc :%s///gc&lt;Left&gt;&lt;Left&gt;&lt;Left&gt;

" Automatically fix the last misspelled word and jump back to where you were.
nnoremap &lt;leader&gt;sp :normal! mz[s1z=`z&lt;CR&gt;
nmap &lt;leader&gt;t :enew&lt;cr&gt;
map &lt;leader&gt;pv :Ex&lt;CR&gt;
map &lt;leader&gt;m :Marks&lt;CR&gt;
nnoremap &lt;leader&gt;x :bd&lt;CR&gt;
map &lt;leader&gt;f :Files&lt;CR&gt;
nnoremap &lt;Leader&gt;+ :vertical resize +10&lt;CR&gt;
nnoremap &lt;Leader&gt;- :vertical resize -10&lt;CR&gt;
nnoremap &lt;silent&gt; &lt;Leader&gt;l :Lines&lt;CR&gt;
nnoremap &lt;silent&gt; &lt;Leader&gt;&lt;Enter&gt; :Buffers&lt;CR&gt;
inoremap &lt;expr&gt; &lt;c-j&gt; ((pumvisible())?("\&lt;C-n&gt;"):("j"))
inoremap &lt;expr&gt; &lt;c-k&gt; ((pumvisible())?("\&lt;C-p&gt;"):("k"))
let g:EasyMotion_do_mapping = 0 " Disable default mappings
map &lt;Space&gt;&lt;Space&gt; &lt;Plug&gt;(easymotion-bd-w)

" -----------------------------------------------------------------------------
" Backups and swap
" -----------------------------------------------------------------------------

silent execute '!mkdir -p /tmp/.vim-backup'
set backupdir=/tmp/.vim-backup
set noswapfile
autocmd BufWritePre * let &amp;bex = '-' . strftime("%Y-%m-%d_%H:%M")
" -----------------------------------------------------------------------------
" Spell Checker toggle
" -----------------------------------------------------------------------------


" set spelllang=en_usdfdsfsdfdsfsdfsf
" function! ToggleSpellCheck()
"   set spell!
"   if &amp;spell
"     echo "Spellcheck ON"
"   else
"     echo "Spellcheck OFF"
"   endif
" endfunction

" nnoremap &lt;silent&gt; &lt;Leader&gt;sp :call ToggleSpellCheck()&lt;CR&gt;
hi clear SpellBad
hi SpellBad cterm=underline,bold
hi SpellBad ctermfg=Red
</pre>
</div>
</div>
</div>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/org-static-blog/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/org-static-blog/html/tag-code.html">code</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
